OpenFOAM-7-master/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/filmRegion/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/wallFilmRegion";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    hf
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       0;
        relTol          1e-3;
    }
    "(Uf|deltaf\*rhof)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
    deltaf
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
}


PISO
{
    momentumPredictor yes;
    nOuterCorr      1;
    nCorr           1;
    nNonOrthCorr    0;
    dfMin           1e-10;
}


relaxationFactors
{}

// ************************************************************************* //
